tap "fluxcd/tap"

brew "ansible"
brew "fd"
brew "gh"
brew "git"
brew "glow"
brew "helm"
brew "jenv"
brew "k9s"
brew "luarocks"
brew "mas"
brew "maven"
brew "minikube"
brew "neovim"
brew "node"
brew "nvm"
brew "openjdk"
brew "oras"
brew "python"
brew "repomix"
brew "so"
brew "spaceship"
brew "tmux"
brew "tofuenv"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "fluxcd/tap/flux"
brew "curl"
brew "texlive"
brew "bat"
brew "fzf"

cask "docker"
cask "alt-tab"
cask "font-meslo-lg-nerd-font"
cask "headlamp"
cask "kitty"
cask "raycast"
cask "arc"
cask "sioyek"
cask "discord"
cask "anki"
cask "jetbrains-toolbox"
cask "spotify"

mas "Command X", id: 6448461551
mas "Goodnotes", id: 1444383602
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Plash", id: 1494023538
mas "Shareful", id: 1522267256
