tap "fluxcd/tap"

# devops
brew "minikube"
brew "helm"
brew "oras"
brew "ansible"
brew "k9s"
brew "fluxcd/tap/flux"
brew "terraform"

# data management
brew "jq"
brew "tree"
brew "curl"
brew "bat"

# cli
brew "git"
brew "git-lfs"
brew "neovim"
brew "tmux"
brew "awscli"

# development
brew "maven"
brew "gradle"
brew "openjdk@8" if not OS.mac? # There is no ARM binary for JDK-8
brew "openjdk@21"
brew "openjdk@17"
brew "openjdk"

brew "uv"
brew "node"
brew "go"
brew "rust"
brew "kotlin"

brew "gcc"
brew "cmake"

cask "android-commandlinetools" if OS.mac?
cask "android-platform-tools" if OS.mac?

# containers
brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-buildx"

# zsh plugins
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "fzf"
brew "starship"

# lazy.nvim dependencies
brew "rg"
brew "luarocks"
brew "texlive"
brew "catimg"
brew "fd"
brew "tree-sitter-cli"

brew "mas" if OS.mac?

cask "font-meslo-lg-nerd-font"
cask "headlamp"
cask "wezterm"
cask "raycast" if OS.mac?
cask "arc" if OS.mac?
cask "sioyek"
cask "discord"
cask "anki"
cask "spotify"
cask "gimp"
cask "curseforge" if OS.mac?
cask "android-studio"
cask "linearmouse"

mas "Command X", id: 6448461551
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Plash", id: 1494023538
mas "Shareful", id: 1522267256
