tap "fluxcd/tap"

# devops
brew "opentofu"
brew "minikube"
brew "helm"
brew "oras"
brew "ansible"
brew "k9s"
brew "fluxcd/tap/flux"
brew "podman"

# data management
brew "jq"
brew "tree"
brew "wget"
brew "curl"
brew "bat"
brew "repomix"

# cli
brew "gh"
brew "git"
brew "git-lfs"
brew "glow"
brew "neovim"
brew "so"
brew "tmux"
brew "spotify_player"

# development
brew "jenv"
brew "maven"
brew "gradle"
brew "openjdk@8" if not OS.mac? # There is no ARM binary for JDK-8
brew "openjdk@21"
brew "openjdk@17"
brew "uv"
brew "node"
brew "nvm"
brew "go"

# zsh plugins
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "fzf"
brew "starship"

# lazy.nvim dependencies
brew "jdtls"
brew "rg"
brew "luarocks"
brew "texlive"
brew "catimg"
brew "fd"

brew "mas" if OS.mac?

# cask "docker-desktop"
cask "alt-tab" if OS.mac?
cask "font-meslo-lg-nerd-font"
cask "headlamp"
cask "wezterm"
cask "raycast" if OS.mac?
cask "arc" if OS.mac?
cask "sioyek"
cask "discord"
cask "anki"
cask "spotify"
cask "gimp"
cask "curseforge" if OS.mac?

mas "Command X", id: 6448461551
mas "Goodnotes", id: 1444383602
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Plash", id: 1494023538
mas "Shareful", id: 1522267256
